[
  {
    "id": "borscht",
    "name": "Домашний Борщ",
    "time": 90,
    "budget": true,
    "vegetarian": false,
    "required": ["beetroot", "cabbage", "potato", "carrot", "onion"],
    "optional": ["beef", "tomato_paste", "garlic", "sour_cream", "greens"],
    "instructions": [
      "Сварите бульон из мяса (если есть). Если вегетарианский — просто кипятите воду.",
      "Нашинкуйте капусту, нарежьте картофель кубиками. Закиньте в кипящий бульон.",
      "Приготовьте зажарку: на сковороде обжарьте лук и морковь до золотистости.",
      "Добавьте тертую свеклу к зажарке. Влейте немного уксуса или лимонного сока (чтобы сохранить цвет) и добавьте томатную пасту. Тушите 10 минут.",
      "Переложите зажарку в кастрюлю. Варите на медленном огне еще 15-20 минут.",
      "В самом конце добавьте измельченный чеснок и зелень. Дайте настояться под крышкой полчаса."
    ]
  },
  {
    "id": "pasta_bolognese",
    "name": "Паста Болоньезе",
    "time": 40,
    "budget": true,
    "vegetarian": false,
    "required": ["pasta", "minced_meat", "tomato_paste", "onion"],
    "optional": ["garlic", "carrot", "cheese", "oil"],
    "instructions": [
      "Мелко нарежьте лук и морковь (если есть). Обжарьте на растительном масле до мягкости.",
      "Добавьте фарш к овощам. Жарьте, постоянно разбивая комочки лопаткой, пока мясо не потемнеет.",
      "Добавьте томатную пасту и полстакана воды (или протертые томаты). Посолите, поперчите.",
      "Тушите соус под крышкой на слабом огне 20 минут, пока он не загустеет.",
      "Отварите макароны аль-денте. Смешайте с соусом или выложите соус сверху. Посыпьте сыром."
    ]
  },
  {
    "id": "olivier",
    "name": "Салат Оливье (классика)",
    "time": 50,
    "budget": true,
    "vegetarian": false,
    "required": ["potato", "carrot", "egg", "bacon", "cucumber", "mayo"],
    "optional": ["onion", "greens", "salt"],
    "instructions": [
      "Отварите картофель и морковь в мундире до готовности. Сварите яйца вкрутую (10 минут).",
      "Остудите и очистите овощи и яйца.",
      "Нарежьте все ингредиенты (картофель, морковь, яйца, колбасу/мясо, огурцы) мелкими кубиками одного размера.",
      "Смешайте все в большой миске.",
      "Заправьте майонезом, посолите по вкусу. Лучше дать постоять в холодильнике час перед подачей."
    ]
  },
  {
    "id": "buckwheat_merchants",
    "name": "Гречка по-купечески",
    "time": 35,
    "budget": true,
    "vegetarian": false,
    "required": ["buckwheat", "minced_meat", "onion", "carrot"],
    "optional": ["tomato_paste", "garlic", "oil"],
    "instructions": [
      "Промойте гречку.",
      "На глубокой сковороде обжарьте лук и морковь.",
      "Добавьте фарш и жарьте до изменения цвета.",
      "Всыпьте гречку к мясу, добавьте ложку томатной пасты.",
      "Залейте кипятком (2 части воды на 1 часть гречки). Посолите.",
      "Накройте крышкой и томите на медленном огне 20-25 минут, пока вода не впитается."
    ]
  },
  {
    "id": "syrniki_pro",
    "name": "Идеальные Сырники",
    "time": 25,
    "budget": true,
    "vegetarian": true,
    "required": ["cheese", "egg", "flour"],
    "optional": ["sugar", "sour_cream", "oil"],
    "instructions": [
      "ВАЖНО: Творог должен быть сухим. Если влажный — отожмите через марлю.",
      "Разомните творог вилкой. Добавьте яйцо, сахар (немного, чтобы не поплыли) и соль.",
      "Всыпайте муку постепенно. Масса должна лепиться, но липнуть к рукам.",
      "Присыпьте стол мукой. Сформируйте из теста колбаску, нарежьте на шайбы.",
      "Сформируйте красивые сырники с помощью ножа или стакана.",
      "Жарьте на небольшом огне под крышкой до золотистой корочки с двух сторон."
    ]
  },
  {
    "id": "shakshuka",
    "name": "Шакшука",
    "time": 20,
    "budget": true,
    "vegetarian": true,
    "required": ["egg", "tomato", "onion", "pepper"],
    "optional": ["garlic", "oil", "bread"],
    "instructions": [
      "Нарежьте лук, перец (если есть) и томаты кубиками.",
      "Обжарьте лук до прозрачности, добавьте перец, затем томаты. Тушите 5-7 минут, чтобы получился густой соус.",
      "Добавьте специи (зира, паприка, перец) и чеснок.",
      "Сделайте ложкой углубления в соусе и аккуратно вбейте туда яйца.",
      "Готовьте на медленном огне, пока белок не побелеет, а желток останется жидким. Подавать с хлебом прямо в сковороде."
    ]
  },
  {
    "id": "draniki",
    "name": "Картофельные Драники",
    "time": 30,
    "budget": true,
    "vegetarian": true,
    "required": ["potato", "onion", "egg", "flour"],
    "optional": ["sour_cream", "oil", "salt"],
    "instructions": [
      "Очистите картофель и лук. Натрите их на мелкой терке (или измельчите в блендере). Лук не даст картофелю почернеть.",
      "Откиньте массу на сито и слегка отожмите лишнюю жидкость — это секрет хрустящих драников.",
      "Добавьте яйцо, соль, перец и пару ложек муки. Перемешайте.",
      "Разогрейте масло. Выкладывайте массу ложкой и разравнивайте.",
      "Жарьте до румяности с двух сторон. Подавать со сметаной."
    ]
  },
  {
    "id": "french_crepes",
    "name": "Тонкие блинчики",
    "time": 40,
    "budget": true,
    "vegetarian": true,
    "required": ["flour", "milk", "egg"],
    "optional": ["sugar", "butter", "oil"],
    "instructions": [
      "Взбейте яйца с сахаром и солью.",
      "Влейте половину молока. Всыпьте муку и размешайте до густоты сметаны (чтобы не было комков).",
      "Влейте оставшееся молоко и пару ложек растительного масла.",
      "Тесто должно быть жидким, как сливки. Оставьте его постоять 15 минут.",
      "Жарьте на раскаленной сковороде, смазывая ее маслом только перед первым блином."
    ]
  },
  {
    "id": "fried_rice_egg",
    "name": "Жареный рис с яйцом (Азия)",
    "time": 15,
    "budget": true,
    "vegetarian": true,
    "required": ["rice", "egg", "onion", "oil"],
    "optional": ["carrot", "garlic", "greens", "bacon"],
    "instructions": [
      "Идеально подходит вчерашний холодный рис.",
      "Нарежьте лук, морковь (и бекон, если есть) мелкими кубиками.",
      "Обжарьте овощи на сильном огне 3 минуты.",
      "Сдвиньте овощи в сторону, разбейте яйца на сковороду и быстро перемешайте их (скрэмбл).",
      "Добавьте рис, перемешайте все вместе. Жарьте еще 3-4 минуты.",
      "В конце можно добавить соевый соус и зеленый лук."
    ]
  },
  {
    "id": "mashed_potatoes_cutlet",
    "name": "Пюрешка с котлеткой",
    "time": 50,
    "budget": false,
    "vegetarian": false,
    "required": ["potato", "minced_meat", "onion", "milk", "butter"],
    "optional": ["bread", "egg", "flour", "oil"],
    "instructions": [
      "Для котлет: смешайте фарш с мелко нарезанным луком, яйцом и замоченным в молоке хлебом. Отбейте фарш об миску.",
      "Сформируйте котлеты, обваляйте в муке и жарьте по 5-7 минут с каждой стороны.",
      "Для пюре: сварите картофель в подсоленной воде до мягкости.",
      "Слейте воду. Добавьте сливочное масло и начните мять.",
      "Влейте горячее (!) молоко и взбейте пюре до пышности (не блендером, а толкушкой)."
    ]
  },
  {
    "id": "simple_salad",
    "name": "Витаминный салат",
    "time": 10,
    "budget": true,
    "vegetarian": true,
    "required": ["cabbage", "carrot", "oil"],
    "optional": ["cucumber", "onion", "sugar", "salt"],
    "instructions": [
      "Тонко нашинкуйте капусту.",
      "Посыпьте солью и сахаром, хорошо помните руками, чтобы она дала сок.",
      "Натрите морковь на крупной терке.",
      "Смешайте, заправьте ароматным маслом и, по желанию, каплей уксуса."
    ]
  }
]
